.emacs.d/init.org
# -*- mode: org; fill-column: 78; lexical-binding: t; after-save-hook: (org-babel-tangle); before-save-hook: (delete-trailing-whitespace) -*-
#+PROPERTY: header-args:emacs-lisp :exports code :results none :tangle init.el
#+STARTUP: overview
#+BEGIN_COMMENT
tangle: C-c C-v C-t
#+END_COMMENT

* Init
The init.el portion of the init.el/config.org from before

#+begin_src emacs-lisp
;; init.el -*- lexical-binding: t; eval: (local-set-key (kbd "C-c i") #'consult-outline); outline-regexp: ";;;";  -*-

;; init.el
;; from https://github.com/danielmai/.emacs.d/blob/master/init.el
;; https://www.reddit.com/r/emacs/comments/5d4hqq/using_babel_to_put_your_init_file_in_org/
;; https://www.reddit.com/r/emacs/comments/673wek/emacs_bankruptcy_and_structure/

;; Don't show the startup screen, disable startup msg in scratch
(setq inhibit-startup-message t)
(setq-default initial-scratch-message nil)

;; Set up package
;; Use M-x Package-refresh-contents to reload the list of packages after initial run
(require 'package)
(setq package-archives
  '(("gnu"    . "https://elpa.gnu.org/packages/") ; default package archive, secure
    ("gnu1"   .  "http://elpa.gnu.org/packages/") ; default package archive
    ("melpa"  . "https://melpa.org/packages/")    ; milkypostman's pkg archive
    ("nongnu" . "https://elpa.nongnu.org/nongnu/"))) ; eat terminal and others
(package-initialize)

;; Bootstrap use-package
;; Install use-package if it's not already installed.
;; use-package is used to configure the rest of the packages.
;; diminish info : https://github.com/emacsmirror/diminish
(unless (or (package-installed-p 'use-package)
            (package-installed-p 'diminish))
  (package-refresh-contents)
  (package-install 'use-package)
  ;(package-install 'diminish)
)

;; enable use-package profiling (M-x use-package-report)
(setq use-package-compute-statistics t)

;; Allow loading from the package cache
;(defvar package-quickstart)
(setq package-quickstart t)
;; package-quickstart-file is a variable defined in ‘package.el’.
;; Its value is "~/.emacs.d/package-quickstart.el"
(setq package-quickstart-file (expand-file-name "var/package-quickstart.el"
                          user-emacs-directory))

;; From use-package README
(eval-when-compile
  (require 'use-package))
;(require 'diminish)                ;; if you use :diminish
(require 'bind-key)

;; Load the config (will re-tangle on org file change)
;(org-babel-load-file (concat user-emacs-directory "config.org"))
#+end_src

* Housekeeping
** initialization
#+begin_src emacs-lisp
; whoami?
(setq
 user-full-name "Douglas Jackson"
 user-mail-address "hpotter@hogworts.edu")

;; more useful frame title that shows either a file or a
;; buffer name (if the buffer isn't visiting a file)
;; commented out to see if its causing emacs 29.1 mac hang
;(setq frame-title-format
;      '((:eval (if (buffer-file-name)
;                   (abbreviate-file-name (buffer-file-name))
;                 "%b"))))

;; Load Customizations if they exist
;; https://lupan.pl/dotemacs/
(setq custom-file "~/Sync/my_homedir_files/emacs.d/custom.el")
(if (file-exists-p custom-file)
    (load custom-file))

;; Add 'info' and 'elisp' to load-path (C-h v load-path RET)
;; NOTE: comment out to avoid error on fresh setup:
;; "Symbol's value as variable is void: Info-additional-directory-list"
;; Found in auctex, use eval-after-load
(eval-after-load 'info
   '(add-to-list 'Info-additional-directory-list
                 "~/Sync/my_homedir_files/emacs.d/info"))

(add-to-list 'load-path "~/.emacs.d/elisp/") ;; elisp packages not in pkg mgr

;; Start server if not currently running and in gui
(when window-system
     (load "server")
     (setq server-socket-dir "~/.emacs.d/var/tmp")
     (unless (server-running-p) (server-start)))
#+end_src

** enable disabled functions
#+begin_src emacs-lisp
;;; enable or disable functions

;; Upcase and downcase regions, default also works on inactive region, use dwim
;(put 'upcase-region 'disabled nil)  ; C-x C-u
;(put 'downcase-region 'disabled nil)  ; C-x C-l
(global-unset-key (kbd "C-x C-u")) ; default is `upcase-region'-region'
(global-unset-key (kbd "C-x C-l")) ; default is `downcase-region'
;(global-unset-key (kbd "M-c"))     ; default is `kill-ring-save', didn't work
;(global-set-key (kbd "M-c") #'capitalize-region) ; was M-c
(global-set-key (kbd "C-x C-u") #'upcase-dwim)   ; was M-u
(global-set-key (kbd "C-x C-l") #'downcase-dwim) ; was M-l
;;--
;(bind-key [remap just-one-space] #'cycle-spacing)
;(bind-key [remap upcase-word] #'upcase-dwim)
;(bind-key [remap downcase-word] #'downcase-dwim)
;(bind-key [remap capitalize-word] #'capitalize-dwim)
;(bind-key [remap count-words-region] #'count-words)

;; Restrict buffer editing to a region
;; Text Narrowing commands:
;;   Region: C-x n n, Page: C-x n p
;;   Funct: C-x n p, Widen: C-x n w
;;   Subtree in Org-Mode:   C-x n s
(put 'narrow-to-region 'disabled nil)
(global-unset-key (kbd "C-x n n"))

;; Goal Column, enter C-x C-n, at point to set column that C-n should go to
;; to clear enter C-u C-x C-n
(put 'set-goal-column 'disabled nil)

;; https://www.emacswiki.org/emacs/ZapUpToChar
(autoload 'zap-up-to-char "misc"
  "Kill up to, but not including ARGth occurrence of CHAR.")
(global-set-key (kbd "M-z") 'zap-up-to-char)

;; disable electric-indent if active, added in Emacs 24.4
(when (fboundp 'electric-indent-mode) (electric-indent-mode -1))
#+end_src

** global key bindings
#+begin_src emacs-lisp
;;; global key bindings

;; Show a summery of all registers with content
(global-set-key (kbd "C-x r v") 'list-registers)

;; Move through windows in reverse order of (other-window), C-x o
(global-set-key (kbd "C-x O") 'previous-multiframe-window)

;; Invoke M-x without the Alt key (from Steve Yegge's blog)
(global-set-key (kbd "C-x C-m") 'execute-extended-command)
;(global-set-key (kbd "C-c C-m") 'execute-extended-command) ; remapped by org to org-ctrl-c-ret

;; ace-window allows switching to window by number, bind to 'C-x o'
;; not installed by default
(use-package ace-window
  :ensure t)
(global-set-key (kbd "C-x o") 'ace-window)
;(setq aw-keys '(?a ?b ?c ?d ?e ?f ?g ?h ?i)) ;; letters instead of numbers
#+end_src

** global settings
#+begin_src emacs-lisp
;;; global settings

;; Compilation buffer scrolls to follow output.
;; set to first-error to stop when the first error appers and set point
(setq compilation-scroll-output t)

;; Enable line-numbers-mode for all programming languages
(add-hook 'prog-mode-hook 'display-line-numbers-mode)

;; enable delete selection mode, so pasting overwrites selection
(delete-selection-mode 1)

;; add org-roam-directory to safe variables
(add-to-list 'safe-local-variable-values '(org-roam-directory . "."))

;; set default shell to zsh
(setq explicit-shell-file-name "/bin/zsh")
(setq shell-file-name "zsh")
(setq explicit-bash.exe-args '("--noediting" "--login" "-i"))
(setenv "SHELL" shell-file-name)

;; Remove trailing whitespace on save
(add-hook 'before-save-hook 'delete-trailing-whitespace)

;; automatically follow symlinks to files under version control without prompting
(setq vc-follow-symlinks t)

;;; Kill line backwards
;;; http://emacsredux.com/blog/2013/04/08/kill-line-backward/
(global-set-key (kbd "C-<backspace>") (lambda ()
                                        (interactive)
                                        (kill-line 0)
                                        (indent-according-to-mode)))

;;; Ping settings (from net-util.el)
;;; http://www.masteringemacs.org/articles/2011/03/02/network-utilities-emacs/
(defvar ping-program-options)
(setq ping-program-options '("-c" "4"))

;;; Enable whitespace-mode for diff buffers
;;; http://stackoverflow.com/questions/11805584/automatically-enable-whitespace-mode-in-diff-mode
(add-hook 'diff-mode-hook
          (lambda ()
            (whitespace-mode 1)))

;;; Enable holidays in Calendar
(setq mark-holidays-in-calendar t)

;; w/o-man mode (elisp man page formater for systems without 'man')
(defvar woman-show-log)
(defvar woman-cache-filename)
(setq woman-show-log nil)
(autoload 'woman "woman"
  "Decode and browse a Unix man page." t)
(setq woman-cache-filename "~/.emacs.d/var/woman_cache.el")

;;; Make tooltips appear in the echo area (checks if function exists)
(tooltip-mode nil)

;;; Emacs 24.4 and later now include something similar: Rectangle Mark mode. After a region is active, type ‘C-x SPC’ to toggle it on and off.
;;; Use CUA mode for rectangles (C-RET to select, normal emacs keys to copy)
;;; http://emacs-fu.blogspot.com/2010/01/rectangles-and-cua.html
;(setq cua-rectangle-mark-key (kbd "C-^"))
(global-unset-key "\C-z")
;(setq cua-rectangle-mark-key (kbd "C-z '"))
(setq cua-rectangle-mark-key (kbd "C-z C-SPC"))  ;; instead of Ctrl-Enter
(cua-selection-mode t)
;(setq cua-enable-cua-keys nil)  ;; only for rectangles, keeps (C-c, C-v, C-x).
;(cua-mode t)

;;; Don't create new lines when pressing 'arrow-down key' at end of the buffer
(setq next-line-add-newlines nil)

;;; Fix delete key working as backspace and not forward deleting
;;; (This only worked in window mode, not terminal. C-d works in both)
(when window-system (normal-erase-is-backspace-mode 1))

;;; Alias to change apropos to ap
(defalias 'ap 'apropos)

;;; hl-line: highlight the current line
(when (fboundp 'global-hl-line-mode)
  (global-hl-line-mode t)) ;; turn it on for all modes by default

;;; Make text mode default major mode with auto-fill enabled
(setq default-major-mode 'text-mode)
(add-hook 'text-mode-hook 'turn-on-visual-line-mode) ;replaces longlines in 23

;;; Auto-scroll in *Compilation* buffer
(setq compilation-scroll-output t)

;;; make Emacs always indent using SPC characters and never TABs
;;; https://www.gnu.org/software/emacs/manual/html_node/emacs/Just-Spaces.html
(setq-default indent-tabs-mode nil)

;;; "y or n" instead of "yes or no", use-short-answers added in Emacs 28.1
;; if odd pop-up vs minibuffer prompt issues, examine us-dialog-box?
;(fset 'yes-or-no-p 'y-or-n-p) ;emacs < 28
(setq use-short-answers t)

;;; Ask before quitting the last Emacs frame
(setq confirm-kill-emacs 'y-or-n-p)

;;; Highlight regions and add special behaviors to regions.
;;; "C-h d transient" for more info.  transient-mark-mode is a toggle.
;;; also in Emacs 22 and greater, C-SPC twice to temp enable transient mark
;(setq transient-mark-mode nil)
(setq transient-mark-mode t)

;;; Display line and column numbers in the mode line
(setq line-number-mode    t
      column-number-mode  t)

;;; Stop blinking cursor
(blink-cursor-mode 0)

;;; Explicitly show the end of a buffer (indicated on left fringe of window)
(set-default 'indicate-empty-lines t)

;;; Line-wrapping
(set-default 'fill-column 78)

;; Don't truncate lines
(setq truncate-lines t
      truncate-partial-width-windows nil)

;; Create new scratch buffer if needed
(run-with-idle-timer 1 t
    (lambda () (get-buffer-create "*scratch*")))

;; allow scroll-down/up-command to move point to buffer end/beginning
;(setq scroll-error-top-bottom 'true)

;; New json-mode - disabled, testing json-ts-mode
;(setq auto-mode-alist (cons '("\\.json\\'" . js-mode) auto-mode-alist))
;(setq auto-mode-alist
;      (append '(("\\.json\\'" . json-mode)  ; note these are encapsulated in a '() list
;        	("\\.jsn\\'" . json-mode))
;               auto-mode-alist))

;; electric-pair
(setq-default electric-pair-inhibit-predicate
              'electric-pair-conservative-inhibit)

;; repl alias for lisp -- read-eval-print-loop
;(defun repl() (interactive) (ielm))
(defalias 'repl 'ielm)

;; desktop-save
;(desktop-save-mode 1)
;(setq desktop-save 'ask)
;; can do 'desktop-clear' for cleanup, add files to NOT close here
;(dolist (file
;        '("+current" "+Last" "work.org" "init.org"))
;  (add-to-list 'desktop-clear-preserve-buffers file))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; bookmarks
;;    ‘C-x r m’ – set a bookmark at the current location (e.g. in a file)
;;    ‘C-x r b’ – jump to a bookmark
;;    ‘C-x r l’ – list your bookmarks
;;    ‘M-x bookmark-delete’ – delete a bookmark by name
(setq
  bookmark-default-file "~/.emacs.d/var/bookmarks" ;; bookmark file location
  bookmark-save-flag 1)                   ;; autosave each change)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#+end_src

